Revit 2026 API

# DatumPlaneMaximize3DExtents Method

---

Computes the 3d extents of all model geometry and levels, and extends the 3d extents of this datum surface to include the model extents.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Maximize3DExtents()
```
```vb
Public Sub Maximize3DExtents
```
```cpp
public:
void Maximize3DExtents()
```
```fsharp
member Maximize3DExtents : unit -> unit
```

Currently does not apply to curved grids.

#### Reference

DatumPlane Class

Autodesk.Revit.DB Namespace